cases/openfoam.com/2dArbitraryMeshInterface/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.025;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo           0.9;

maxDeltaT       0.01;

libs
(
    "libsolverFunctionObjects.so"
);

functions
{
    // This few lines constructs a passive scalar equation on the fly:
    // ddt(rho, S) + div(phi, S) == laplacian(muEff, S) + sources
    // Sources can be added using the fvOption feature
    // The scalar is named "S" and the diffusion is set to a constant value
    passiveScalar
    {
        type            scalarTransport;
        writeControl    outputTime;
        field           S;
        D               1e-6;
        autoSchemes     true;
        nCorr           0;
        resetOnStartUp  false;
    }

    // Save the residuals into postProcessing/residuals/
    //#includeFunc residuals
}

// ************************************************************************* //
