cases/openfoam.com/2dArbitraryMeshInterface/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet 
    {
        type            zeroGradient;
    }

    pipe
    {
        type            zeroGradient;
    }

    outlet 
    {
        type            fixedValue;
        value           uniform 0;
    }

    innerWall 
    {
        type            zeroGradient;
    }

    outerWall 
    {
        type            zeroGradient;
    }

    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back 
    {
        type            empty;
    }
}


// ************************************************************************* //
